; This is original dump of S4U settings, those were default values in my printer

M5000 I0 A0 B230.000000      ;Z轴行程(mm)
M5000 I0 A0 C20.000000      ;Z轴电机最高速度(mm/s)
M5000 I0 A0 D0.000625000000  ;Z轴电机每步对应的距离(mm/step)
M5000 I0 A0 E1      ;Z轴电机方向;1为正方向,-1为反方向
M5000 I0 A0 F1      ;Z轴限位模式;0最小限位,1最大限位,2双限位
M5000 I0 A0 S1      ;Z轴归零方向;1为正方向,-1为反方向
M5000 I0 A0 P4.500000      ;Z轴第一段归零速度(mm/s)
M5000 I0 A0 R1.000000      ;Z轴第二段归零速度(mm/s)
M5000 I0 A0 T0.000000      ;Z轴归零前反方向移动距离(mm);该参数主要用于限位装配离物理零点较远情况下避免轴位于限位之下时候归零撞机
M5000 I0 A0 X5.000000      ;Z轴归零过程中第一次触发限位后反向移动的距离(mm)
M5000 I0 A0 Y0.850001      ;Z轴零点位置
M5000 I0 A0 Z1      ;Z零点与限位位置设置; 0:限位位置和Z的零点相同，1:限位位置即和Z的零点不同
M5000 I5 A0 B0      ;Z轴最小限位极性;0为低电平触发;1为高电平触发
M5000 I5 A0 C0      ;Z轴最大限位极性;0为低电平触发;1为高电平触发
M5000 I5 A0 D5.000000      ;Z轴加速度(mm/s^2)
M5000 I5 A0 E0.050000      ;Z轴初始速度(mm/s)
M5000 I6  A12      ;X轴静止状态下电机电流(0-31) : (N+1)/32 * 2.5 (A)
M5000 I6  B25      ;X轴电机运行电流(0-31) : (N+1)/32 * 2.5 (A)
M5000 I6 C36.000000      ;X轴加速度(度/s^2)
M5000 I6 D36.000000      ;X轴减速度(度/s^2)
M5000 I6 E36.000000      ;X轴初速度(度/s)
M5000 I6 P1      ;X轴每次电流变化阶梯值(1-31)
M5000 I6 R1000      ;X轴每次电流变化时间间隔(ms)
M5000 I6  F9      ;Z轴静止状态下电机电流(0-31) : (N+1)/32 * 2.5 (A)
M5000 I6  S18      ;Z轴电机运行电流(0-31) : (N+1)/32 * 2.5 (A)
M5000 I0 A1 B140.000000      ;X轴离型总角度(度)
M5000 I0 A1 C900.000000      ;X轴电机最高速度(度/s)
M5000 I0 A1 D0.007031250000  ;X轴电机每步对应的角度(度/step)
M5000 I0 A1 E1      ;X轴电机方向;1为正方向,-1为反方向
M5000 I0 A1 F1      ;X轴限位模式;0最小限位,1最大限位,2双限位
M5000 I0 A1 S1      ;X轴归零方向;1为正方向,-1为反方向
M5000 I0 A1 P36.000000      ;X轴第一段归零速度(度/s)
M5000 I0 A1 R36.000000      ;X轴第二段归零速度(度/s)
M5000 I0 A1 T0.000000      ;X轴归零前反方向移动角度(度);该参数主要用于限位装配离物理零点较远情况下避免轴位于限位之下时候归零撞机
M5000 I0 A1 X60.000000      ;X轴归零过程中第一次触发限位后反向移动的角度(度)
M5000 I0 A1 Y0.000000      ;X轴零点位置
M5000 I0 A1 Z1      ;X零点与限位位置设置; 0:限位位置和Z的零点相同,1:限位位置即和Z的零点不同
M5000 I5 A1 B0      ;X轴最小限位极性;0为低电平触发;1为高电平触发
M5000 I5 A1 C0      ;X轴最大限位极性;0为低电平触发;1为高电平触发
M5000 I200 A36.000000      ;X轴头N层第一段回平速度<高速> (度/s)
M5000 I200 B36.000000      ;X轴头N层第二段回平速度<低速> (度/s)
M5000 I200 C36.000000      ;X轴头N层第一段离型速度<低速> (度/s)
M5000 I200 D36.000000      ;X轴头N层第二段离型速度<高速> (度/s)
M5000 I200 E0.000000      ;X轴头N层第二段回平角度(度)
M5000 I200 F0.000000      ;X轴头N层第一段离型角度(度)
M5000 I200 S72.000000      ;X轴N层后第一段回平速度<高速> (度/s)
M5000 I200 P72.000000      ;X轴N层后第二段回平速度<低速> (度/s)
M5000 I200 R72.000000      ;X轴N层后第一段离型速度<低速> (度/s)
M5000 I200 T72.000000      ;X轴N层后第二段离型速度<高速> (度/s)
M5000 I200 X0.000000      ;X轴N层后第二段回平角度(度)
M5000 I200 Y0.000000      ;X轴N层后第一段离型角度(度)
M5000 I201 A1      ;X轴回平模式( 0:限位方式 1:固定角度)
M5000 I201 B1      ;旋转离型模式，0:两电机同步运动 1：X轴电机先到位，Z轴再开始动 2：Z轴电机先运动，X轴再开始动
M5000 I201 E50      ;X轴N层值
M5000 I210 A36.000000      ;S2-X轴头N层第一段回平速度<高速> (度/s)
M5000 I210 B36.000000      ;S2-X轴头N层第二段回平速度<低速> (度/s)
M5000 I210 C36.000000      ;S2-X轴头N层第一段离型速度<低速> (度/s)
M5000 I210 D36.000000      ;S2-X轴头N层第二段离型速度<高速> (度/s)
M5000 I210 E0.000000      ;S2-X轴头N层第二段回平角度(度)
M5000 I210 F0.000000      ;S2-X轴头N层第一段离型角度(度)
M5000 I210 S144.000000      ;S2-X轴N层后第一段回平速度<高速> (度/s)
M5000 I210 P144.000000      ;S2-X轴N层后第二段回平速度<低速> (度/s)
M5000 I210 R144.000000      ;S2-X轴N层后第一段离型速度<低速> (度/s)
M5000 I210 T144.000000      ;S2-X轴N层后第二段离型速度<高速> (度/s)
M5000 I210 X0.000000      ;S2-X轴N层后第二段回平角度(度)
M5000 I210 Y0.000000      ;S2-X轴N层后第一段离型角度(度)
M5000 I211 A1      ;S2-X轴回平模式( 0:限位方式 1:固定角度)
M5000 I211 B1      ;S2-旋转离型模式，0:两电机同步运动 1：X轴电机先到位，Z轴再开始动 2：Z轴电机先运动，X轴再开始动
M5000 I211 E50      ;S2-X轴N层值
M5000 I201 C40.000000      ;X轴手动控制速度(度/s)
M5000 I201 D-10.000000      ;X轴最大零点位置，归零后能够继续调平的大小(度)
M5000 I1 A4.500000      ;完成打印抬升速度(mm/s)
M5000 I1 B60.000000      ;完成打印后抬升一段相对距离(mm)
M5000 I1 C1      ;完成打印抬升模式;0抬升最高点,1抬升到指定的相对距离,2无动作
M5000 I1 D4.500000      ;暂停打印抬升速度(mm/s)
M5000 I1 E60.000000      ;暂停打印后抬升一段相对距离(mm)
M5000 I1 F1      ;暂停打印抬升模式;0抬升最高点,1抬升到指定的相对距离,2无动作
M5000 I1 S4.500000      ;停止打印抬升速度(mm/s)
M5000 I1 P60.000000      ;停止打印后抬升一段相对距离(mm)
M5000 I1 R1      ;停止打印抬升模式;0抬升最高点,1抬升到指定的相对距离,2无动作
M5000 I1 T4.500000      ;手动控制速度(mm/s)
M5000 I2 B200      ;光源风扇频率
M5000 I2 C200      ;光源频率
M5000 I2 D200      ;照明灯频率
M5000 I2 E3000      ;蜂鸣器频率
M5000 I3 B2      ;光源风扇模式;0开机常开,1开机关闭,2跟随打印状态,3跟随曝光状态
M5000 I3 C2      ;光源模式;0仅跟随机器参数,1仅跟随打印文件,2混合两个打印文件与机器参数
M5000 I4 B255      ;光源风扇PWM(0-255)
M5000 I4 C255      ;光源PWM(0-255)
M5000 I4 D255      ;照明灯PWM(0-255)
M5000 I4 E100      ;蜂鸣器音量(0-100)
M5000 I4 F0      ;屏幕方向(0-3),0:0,1:90,2:180,3:270
M5000 I4 S180      ;进入屏保时间（s）
M5000 I7 A80      ;温度保护上限(℃)
M5000 I7 B1      ;屏蔽温度检测 0:屏蔽 1:不屏蔽
M5000 I4 P5      ;进入灰色屏保时间（min）
M5000 I4 R0      ;预估树脂值屏蔽 0:屏蔽 1:不屏蔽
M5000 I4 T870.000000      ;料槽最大容积(ml)
M5000 I4 X25.500000      ;实际树脂检测阶段异常最大线(mm)
M5000 I4 Y4.000000      ;实际树脂检测阶段异常最小线(mm)
M5000 I8 A50      ;工厂模式温度传感器最大值(℃)
M5000 I8 B0      ;工厂模式温度传感器最小值(℃)
M5000 I203 B4.500000      ;应变片校准过程运动速度(mm/s)
M5000 I203 C30000      ;应变片最大校准时间(ms)
M5000 I203 D5000      ;应变片静止判定时间(ms)
M5000 I203 E50      ;应变片静止判定阈值
M5000 I204 A45.000000      ;树脂检测起始位置(mm)，至少要大于结构上最高液位位置开始测量。
M5000 I204 B2.000000      ;树脂检测结束位置(mm)，建议设置1mm或者2mm。不要贴底，太贴底受到膜的应力会误判。
M5000 I204 C0.050000      ;树脂检测过程步进值(mm)，建议0.05mm，过小探测时间长，过大容易导致预估误差增加
M5000 I204 D2.500000      ;树脂检测过程运动速度(mm/s)
M5000 I204 E200      ;树脂检测触发阈值，当下探受到液面应力大于该阈值认定为触发液位。
M5000 I204 S143.000000      ;料槽宽度(mm)，固件使用该参数结合探测到的液位高度预估容器内体积
M5000 I204 P244.000000      ;料槽高度(mm)，固件使用该参数结合探测到的液位高度预估容器内体积
M5000 I204 R100.000000      ;树脂检测预估体积补偿值(ml)。
M5000 I205 A2.000000      ;自动调平起始位置(mm)，建议大于1mm，在膜没有对平台产生应力的地方开始下探调平。
M5000 I205 B-2.000000      ;自动调平结束位置(mm)，建议设置-1mm，过大可能损害屏幕。
M5000 I205 C0.050000      ;自动调平步进值(mm)，建议0.05mm，过小调平时间长，过大容易导致压的过紧。
M5000 I205 D2.000000      ;自动调平运动速度(mm/s)，不宜高速。
M5000 I205 E10000      ;自动调平阈值，正常情况下该值大于0。该值调节过程中已经考虑树脂本身带来的影响。
M5000 I206 C10000      ;异物检测触发阈值
M5000 I206 D1      ;树脂检测探测开关
M5000 I206 E10      ;树脂检测探测次数
M5000 I206 F-200      ;树脂检测探测最小阈值
M5000 I206 S200      ;树脂检测探测最大阈值
M5000 I208 A1      ;AI摄像头检测开关，0,关闭，1，开启
M5000 I208 B100.000000      ;AI摄像头检测位置
M5000 I209 A1      ;延时摄影开关，0,关闭，1，开启
M5000 I209 B50.000000      ;不进行延时摄影拍摄的模型高度阈值
M5000 I209 C30.000000      ;开始进行延时摄影拍摄的模型高度
M5000 I209 D10      ;延时摄影间隔层数
M5000 I209 E0      ;手动归零Z是否移动到零位置
M5000 I209 F1      ;手动归零X是否移动到零位置
M5000 I212 A8420      ;n层前慢速模式,x轴运动时间(ms)
M5000 I212 B4410      ;n层后慢速模式,x轴运动时间(ms)
M5000 I212 C8420      ;n层前快速模式,x轴运动时间(ms)
M5000 I212 D2430      ;n层后快速模式,x轴运动时间(ms)
M5000 I212 E0      ;预估打印补偿时间(ms),可以是负数
M5000 I209 S10000      ;延时摄影快拍时间(现实时间 单位:ms)
M5000 I209 P70      ;延时摄影快拍张数间隔时间(ms)
M5999 I0           ;保存机器参数
